In [2]:
#Import pandas untuk input file csv
import pandas as pd

In [3]:
#Input data food delivery
data = pd.read_csv(r'D:/python/datasain/food_delivery_datasets.csv')
print(data)

        order_id  voucher_amount                   date_time  eta_seconds  \
0     FOOD-10455               0  2018-08-12T20:35:08.001006         1800
1     FOOD-10985               0  2018-09-23T17:44:12.243273         2173
2     FOOD-10911               0  2018-09-19T18:08:09.387991         1418
3     FOOD-10932               0  2018-09-21T01:24:35.272499         1903
4     FOOD-10961               0  2018-09-22T17:57:45.523161         1716
...          ...             ...                         ...          ...
1071  FOOD-10921               0  2018-09-20T15:01:52.152828          900
1072  FOOD-10265            5000  2018-07-26T14:43:23.655294         1579
1073  FOOD-10534               0  2018-08-21T20:10:59.283185         2606
1074  FOOD-10158               0  2018-07-16T14:42:23.214427         2428
1075  FOOD-10770               0  2018-09-11T14:18:19.494258         1547

      food_price  cust_id  rating  delivery_fee   resto_id     status  \
0          18900  1089034     5.0          4000  742638033  Completed
1         149000   180146     5.0         11000  742767245  Completed
2          43800   366528     NaN          9000  742618303  Completed
3          39900   511038     5.0         14000  742541172  Completed
4          77700  1220358     NaN          4000  742604875  Completed
...          ...      ...     ...           ...        ...        ...
1071      103200  1296335     5.0          4000  742742150  Completed
1072      145700  1135466     5.0          7000  742566851  Completed
1073      177200  1383625     NaN         15000  742571888  Completed
1074       49300  1094787     5.0          9000  742725064  Completed
1075       43000  1010922     5.0          9000  742594499  Completed

      random_id
0      0.511149
1      0.832936
2      0.828026
3      0.239377
4      0.995587
...         ...
1071   0.248328
1072   0.268251
1073   0.132528
1074   0.167946
1075   0.358051

[1076 rows x 11 columns]

In [5]:
id_pelanggan=data.groupby("cust_id")
id_pelanggan["cust_id"].count()

cust_id
22895       2
59565       3
62551       3
70701       3
82690       5
           ..
1510407     1
1514562    13
1542763     4
1544551     5
1548571     6
Name: cust_id, Length: 138, dtype: int64

In [6]:
id_pelanggan["cust_id"].count() \
                                        .reset_index(name='count') \
                                        .sort_values(['count'], \
                                                    ascending=False)

     cust_id  count
28    366528     32
27    361927     31
22    316834     30
95   1094787     30
29    366721     30
..       ...    ...
124  1392044      1
123  1387972      1
41    514284      1
15    185166      1
81    979027      1

[138 rows x 2 columns]